# Pandas

### Pandas stand for Panel Data and is the core library for Data Manipulation and Data Analysis

Pandas is a library built using NumPy specifically for data analysis. You'll be using Pandas heavily for data manipulation, visualisation, building machine learning models, etc. 

There are two main data structures in Pandas:
- Series: `pd.Series(data, dtype)`
- Dataframes: `pd.DataFrame(dictionary_name)`

The default way to store data is dataframes, and thus manipulating dataframes quickly is probably the most important skill set for data analysis.

In [2]:
# import pandas, pd is an alias

import pandas as pd
import numpy as np

### The Pandas Series 

A series is similar to a 1-D numpy array, and contains scalar values of the same type (numeric, character, datetime etc.). 
A dataframe is simply a table where each column is a pandas series.

Syntax: 
1. ```pd.Series(values, index=index, name=name)```
2. ```pd.Series({'idx1': val1, 'idx2': val2}```

In [3]:
# Creating a numeric pandas series
s = pd.Series([2, 4, 5, 6, 9])
print(s)
print(type(s))

0    2
1    4
2    5
3    6
4    9
dtype: int64
<class 'pandas.core.series.Series'>

In [10]:
# creating a series of type datetime
date_series = pd.date_range(start = '11-09-2017', end = '12-12-2017')
print(date_series)
type(date_series)
print(date_series.size)

DatetimeIndex(['2017-11-09', '2017-11-10', '2017-11-11', '2017-11-12',
               '2017-11-13', '2017-11-14', '2017-11-15', '2017-11-16',
               '2017-11-17', '2017-11-18', '2017-11-19', '2017-11-20',
               '2017-11-21', '2017-11-22', '2017-11-23', '2017-11-24',
               '2017-11-25', '2017-11-26', '2017-11-27', '2017-11-28',
               '2017-11-29', '2017-11-30', '2017-12-01', '2017-12-02',
               '2017-12-03', '2017-12-04', '2017-12-05', '2017-12-06',
               '2017-12-07', '2017-12-08', '2017-12-09', '2017-12-10',
               '2017-12-11', '2017-12-12'],
              dtype='datetime64[ns]', freq='D')
34

In [11]:
pd.date_range(start='08-02-1999', end='08-06-2021').size

8041

### The Pandas Dataframe 

Dataframe is the most widely used data-structure in data analysis. It is a table with rows and columns, with rows having an index and columns having meaningful names.

There are various ways of creating dataframes, such as creating them from dictionaries, JSON objects, reading from txt, CSV files, etc. 

Syntax: ```pd.DataFrame(values, index=index, columns=col_names)```

#### Creating dataframes from dictionaries

In [12]:
# Defining data to create lists for dictionary
cars_per_cap = [809, 731, 588, 18, 200, 70, 45]
country = ['United States', 'Australia', 'Japan', 'India', 'Russia', 'Morocco', 'Egypt']
drives_right = [False, True, True, True, False, False, False]

In [17]:
# Creating the dictionaries to store the entries as key-value pair.
cars_dict = {"cars_per_cap" : cars_per_cap, "country" : country, "drives_right" : drives_right }

# Create the dataframe 'cars'
cars = pd.DataFrame(cars_dict)

# Print created dataframe
cars

   cars_per_cap        country  drives_right
0           809  United States         False
1           731      Australia          True
2           588          Japan          True
3            18          India          True
4           200         Russia         False
5            70        Morocco         False
6            45          Egypt         False

In [23]:
# read the data from the csv file
cars = pd.read_csv('cars.csv')

cars

    USCA   US United States    809  FALSE
0  ASPAC  AUS     Australia  731.0   True
1  ASPAC  JAP         Japan  588.0   True
2  ASPAC   IN         India   18.0   True
3  ASPAC   RU        Russia  200.0  False
4  LATAM  MOR       Morocco   70.0  False
5    AFR   EG         Egypt   45.0  False
6    EUR  ENG       England    NaN   True

In [24]:
# read the data from the csv file with no header name
cars1 = pd.read_csv('cars.csv', header=None)

cars1

       0    1              2      3      4
0   USCA   US  United States  809.0  False
1  ASPAC  AUS      Australia  731.0   True
2  ASPAC  JAP          Japan  588.0   True
3  ASPAC   IN          India   18.0   True
4  ASPAC   RU         Russia  200.0  False
5  LATAM  MOR        Morocco   70.0  False
6    AFR   EG          Egypt   45.0  False
7    EUR  ENG        England    NaN   True

In [25]:
# read the data from the csv file and make 1st col as row index
cars2 = pd.read_csv('cars.csv', header=None, index_col=1)

cars2

         0              2      3      4
1
US    USCA  United States  809.0  False
AUS  ASPAC      Australia  731.0   True
JAP  ASPAC          Japan  588.0   True
IN   ASPAC          India   18.0   True
RU   ASPAC         Russia  200.0  False
MOR  LATAM        Morocco   70.0  False
EG     AFR          Egypt   45.0  False
ENG    EUR        England    NaN   True

In [35]:
cars

    USCA   US United States    809  FALSE
0  ASPAC  AUS     Australia  731.0   True
1  ASPAC  JAP         Japan  588.0   True
2  ASPAC   IN         India   18.0   True
3  ASPAC   RU        Russia  200.0  False
4  LATAM  MOR       Morocco   70.0  False
5    AFR   EG         Egypt   45.0  False
6    EUR  ENG       England    NaN   True

In [36]:
# Print the column headers of the dataframe

cars.columns

Index(['USCA', 'US', 'United States', '809', 'FALSE'], dtype='object')

In [38]:
# Change the label of each column
cars.columns = ['Region Code', 'Country Code', 'Country', 'Cars Per Capita', 'Drives Right']

# Check the created dataframe
cars

  Region Code Country Code    Country  Cars Per Capita  Drives Right
0       ASPAC          AUS  Australia            731.0          True
1       ASPAC          JAP      Japan            588.0          True
2       ASPAC           IN      India             18.0          True
3       ASPAC           RU     Russia            200.0         False
4       LATAM          MOR    Morocco             70.0         False
5         AFR           EG      Egypt             45.0         False
6         EUR          ENG    England              NaN          True

In [50]:
# Create own dataframe
df1 = pd.DataFrame(np.arange(0, 20).reshape(5, 4), index=['ROW1','ROW2','ROW3','ROW4','ROW5'], columns=['COLUMN1','COLUMN2','COLUMN3','COLUMN4',])
df1.head()

      COLUMN1  COLUMN2  COLUMN3  COLUMN4
ROW1        0        1        2        3
ROW2        4        5        6        7
ROW3        8        9       10       11
ROW4       12       13       14       15
ROW5       16       17       18       19

In [ ]:
df = pd.read_csv("TopSellingAlbums.csv")

# Print first five rows
df.head()

In [64]:
# Print last five rows
df.tail()

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
145,146,6.7,3.0,5.2,2.3,Iris-virginica
146,147,6.3,2.5,5.0,1.9,Iris-virginica
147,148,6.5,3.0,5.2,2.0,Iris-virginica
148,149,6.2,3.4,5.4,2.3,Iris-virginica
149,150,5.9,3.0,5.1,1.8,Iris-virginica

In [53]:
# Get the column name list

df.columns

Index(['Id', 'SepalLengthCm', 'SepalWidthCm', 'PetalLengthCm', 'PetalWidthCm',
       'Species'],
      dtype='object')

In [55]:
# Access specific column

x = df[['Species']]
x.head()

       Species
0  Iris-setosa
1  Iris-setosa
2  Iris-setosa
3  Iris-setosa
4  Iris-setosa

In [56]:
# Access multiple columns

y = df[['SepalLengthCm', 'Species']]
y.head()

   SepalLengthCm      Species
0            5.1  Iris-setosa
1            4.9  Iris-setosa
2            4.7  Iris-setosa
3            4.6  Iris-setosa
4            5.0  Iris-setosa

### Indexing and Slicing

1. ```s_df.loc[]```: Refers only to the index labels
2. ```s_df.iloc[]```: Refers only to the integer location, similar to lists or Numpy arrays
3. ```s_df.loc[rows]```: Some rows (all columns in a DataFrame)
4. ```df.loc[:, cols_list]```: All rows, some columns
5. ```df.loc[rows, cols]```: Subset of rows and columns

Create masks with, for example, comparisons
```mask = df['X'] < 0```
6. ```s_df.loc[mask]```: Boolean mask of rows (all columns)
7. ```df.loc[mask, cols]```: Boolean mask of rows, some columns

In [58]:
# Access value of first row and first column using `iloc` - search by index

df.iloc[0, 2]

3.5

In [59]:
# Access value of first row and first column using `loc` - search by column name

df.loc[0, 'SepalLengthCm']

5.1

In [61]:
# Slicing of data

df.iloc[0:2, 0:3]       # [row, column]

   Id  SepalLengthCm  SepalWidthCm
0   1            5.1           3.5
1   2            4.9           3.0

In [62]:
# Slicing of data using column name

df.loc[0:2, 'SepalLengthCm':'PetalWidthCm']

   SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm
0            5.1           3.5            1.4           0.2
1            4.9           3.0            1.4           0.2
2            4.7           3.2            1.3           0.2

### Manipulating Series and DataFrames

1. Manipulating Columns:
    * ```df.rename(columns={old_name: new_name})```: Renames column
    * ```df.drop(name_or_names, axis='columns')```: Drops column name

2. Manipulating Index
    * ```s_df.reindex(new_index)```: Conform to new index
    * ```s_df.drop(labels_to_drop)```: Drops index labels
    * ```s_df.rename(index={old_label: new_label})```: Renames index labels
    * ```s_df.sort_index()```: Sorts index labels
    * ```df.set_index(column_name_or_names)```: set column as index
    * ```s_df.reset_index()```: Inserts index into columns, resets index to default integer index.

3. Manipulating Values:
    * ```df.sort_values(col_name, ascending=True)```: All row values and the index will follow:

### Important Attributes and Methods
1. ```s_df.index```: Array-like row labels
2. ```df.columns```: Array-like column labels
3. ```s_df.values```: Numpy array, data
4. ```s_df.shape```: (n_rows, m_cols)
5. ```s.dtype, df.dtypes```: Type of Series, of each column
6. ```len(s_df)```: Number of rows
7. ```s_df.head() and s_df.tail()```: First/last(5) rows
8. ```s.unique()```: Series of unique values
9. ```s_df.describe()```: Summary stats
10. ```df.info()```: Memory usage

In [69]:
df.sum()

Id                                                           11325
SepalLengthCm                                                876.5
SepalWidthCm                                                 458.1
PetalLengthCm                                                563.8
PetalWidthCm                                                 179.8
Species          Iris-setosaIris-setosaIris-setosaIris-setosaIr...
dtype: object